# Переменные орифматические операторы Основные типы данных

# переменна это ячейка которая хранить данные 
num = 123
print(num) # функция print(пачатает на терминал)
name = 'Hikmatillo'
print(name)

# Орифммтеические операторы 
a = 12
b = 2
print(a + b)    # + (Сложение): Складывает два операнда.
print(a - b)    # - (Вычитание): Вычитает правый операнд из левого.
print(a * b)    # * (Умножение): Перемножает два операнда.
print(a / b)    # / (Деление): Делит левый операнд на правый. Результат всегда будет float.
print(a // b)   # // (Целочисленное деление): Делит левый операнд на правый и возвращает целую часть результата.
print(a % b)    # % (Остаток от деления): Возвращает остаток от деления левого операнда на правый.
print(a ** b)   # ** (Возведение в степень): Первый операнд возводится в степень второго операнда.

# Задачка
num1 = int(input("Введите первое число: ")) # функция input возваляет вводить данные с терминала
num2 = int(input("Введиет второе число: ")) 
print(num + num2)

# Основные типы данных 
int = 123   # Целое число
float = 23.45   # Дробная число
str = "Hello world" # Строка
bool = True,False # Логический тип данный 

# c помощью встроенной функции  type узнаем тип
print(type(1))
print(type(1.5))
print(type("hello"))

